
choose_language_text = '🌍 Пожалуйста, выберите язык / Choose language'

wallet_text_ru = '''

Текущий баланс : {balance!s} {mnt!s}
Публичный адрес кошелька : {number!s}
Seed-phrase:{seed!s}'

'''

wallet_text_eng = '''

Текущий баланс : {balance!s} {mnt!s}
Публичный адрес кошелька : {number!s}
Seed-phrase:{seed!s}'
ENGLISH
'''

rooles_text_ru = '''

Привет, {user_name}!
Я бот
Правила моей игры очень просты - когда ты пишешь dice time в любом телеграм чате где я добавлен, автоматически бросается игральная кость
Если на ней выпало больше 3, то ты выигрываешь монеты {coin_ticker}
Количество монет зависит от того какое число тебе выпало и насколько большой чат в котором произошел бросок кубика
Ты не можешь выиграть дважды в одном и том же чате в один и тот же день (но не запрещено выигрывать в разных чатах или в разные дни)
Платить ничего не нужно, я полностью бесплатен.
Проиграть в моей игре тоже ничего нельзя, те монеты которые ты выиграешь не уменьшаются, даже если на игральной кости выпадет 1
Создан для фана, после нового апдейта телеграм, в котором появилась возможность бросать игровую кость.

'''

rooles_text_eng = '''

Привет, {user_name}!
Я бот
Правила моей игры очень просты - когда ты пишешь dice time в любом телеграм чате где я добавлен, автоматически бросается игральная кость
Если на ней выпало больше 3, то ты выигрываешь монеты {coin_ticker}
Количество монет зависит от того какое число тебе выпало и насколько большой чат в котором произошел бросок кубика
Ты не можешь выиграть дважды в одном и том же чате в один и тот же день (но не запрещено выигрывать в разных чатах или в разные дни)
Платить ничего не нужно, я полностью бесплатен.
Проиграть в моей игре тоже ничего нельзя, те монеты которые ты выиграешь не уменьшаются, даже если на игральной кости выпадет 1
Создан для фана, после нового апдейта телеграм, в котором появилась возможность бросать игровую кость.
ENGLISH
'''

take_money_text_ru = '😎 Забрать монеты'
take_money_text_eng = '😎 Забрать монеты ENG'

start_winner_text_ru= '''

Привет, {user_name}!
Я создал для тебя кошелек для монет Minter которые ты выиграл
Слово Minter - ссылка ведущая на

Адрес кошелька: `{user_wallet_address}`
Seed фраза (твой секретный пароль от кошелька): `{user_seed_phrase}`

Ты можешь потратить эти монеты в новой мультиплеерной telegram игре Time Loop: @timeloopminterbot
Это сообщение представляет собой видео ролик с текстом
Видео ролик: https://www.dropbox.com/s/jjj7f4h3jl8joko/ad1.mp4?dl=0

Или продать их кому-нибудь
Кошелек для работы с этими и подобными монетами Minter:
https://www.bip.to/

'''

start_winner_text_eng = '''

Привет, {user_name}!
Я создал для тебя кошелек для монет Minter которые ты выиграл
Слово Minter - ссылка ведущая на

Адрес кошелька: `{user_wallet_address}`
Seed фраза (твой секретный пароль от кошелька): `{user_seed_phrase}`

Ты можешь потратить эти монеты в новой мультиплеерной telegram игре Time Loop: @timeloopminterbot
Это сообщение представляет собой видео ролик с текстом
Видео ролик: https://www.dropbox.com/s/jjj7f4h3jl8joko/ad1.mp4?dl=0

Или продать их кому-нибудь
Кошелек для работы с этими и подобными монетами Minter:
https://www.bip.to/
ENGLISH
'''

hello_text_ru = '''
Ты можешь потратить выигранные монеты в новой мультиплеерной telegram игре Time Loop: @timeloopminterbot
Это сообщение представляет собой видео ролик с текстом
Видео ролик: https://www.dropbox.com/s/jjj7f4h3jl8joko/ad1.mp4?dl=0
'''

hello_text_eng = '''
Ты можешь потратить выигранные монеты в новой мультиплеерной telegram игре Time Loop: @timeloopminterbot
Это сообщение представляет собой видео ролик с текстом
Видео ролик: https://www.dropbox.com/s/jjj7f4h3jl8joko/ad1.mp4?dl=0
ENGLISH
'''

text_answer = 'Здесь кидаем кубик'
text_winner_ru = '''Поздравляю! Вы выиграли {X!s} монет {coin_ticker!s}'''

text_winner_eng ='''Поздравляю! Вы выиграли {X!s} монет {coin_ticker!s} ENGLISH'''


start_no_winner_text_ru = '''

Привет, {user_name!s}!
Я бот
Правила моей игры очень просты - когда ты пишешь dice time в любом телеграм чате где я добавлен, автоматически бросается игральная кость
Если на ней выпало больше 3, то ты выигрываешь монеты {coin_ticker!s}
Количество монет зависит от того какое число тебе выпало и насколько большой чат в котором произошел бросок кубика
Ты не можешь выиграть дважды в одном и том же чате в один и тот же день (но не запрещено выигрывать в разных чатах или в разные дни)
Платить ничего не нужно, я полностью бесплатен.
Проиграть в моей игре тоже ничего нельзя, те монеты которые ты выиграешь не уменьшаются, даже если на игральной кости выпадет 1
Создан для фана, после нового апдейта телеграм, в котором появилась возможность бросать игровую кость.

Кстати, я сразу создал для тебя кошелек для монет Minter, куда попадут монеты когда ты их выиграешь
Слово Minter - ссылка ведущая на https://www.minter.network/
Адрес кошелька:`{user_wallet_address!s}`

Seed фраза (твой секретный пароль от кошелька):  `{user_seed_phrase!s}`

Ты можешь потратить выигранные монеты в новой мультиплеерной telegram игре Time Loop: @timeloopminterbot
Это сообщение представляет собой видео ролик с текстом
Видео ролик: https://www.dropbox.com/s/jjj7f4h3jl8joko/ad1.mp4?dl=0

Или продать их кому-нибудь
Кошелек для работы с этими и подобными монетами Minter:
https://www.bip.to/

'''

start_no_winner_text_eng = '''

Привет, {user_name!s}!
Я бот
Правила моей игры очень просты - когда ты пишешь dice time в любом телеграм чате где я добавлен, автоматически бросается игральная кость
Если на ней выпало больше 3, то ты выигрываешь монеты {coin_ticker!s}
Количество монет зависит от того какое число тебе выпало и насколько большой чат в котором произошел бросок кубика
Ты не можешь выиграть дважды в одном и том же чате в один и тот же день (но не запрещено выигрывать в разных чатах или в разные дни)
Платить ничего не нужно, я полностью бесплатен.
Проиграть в моей игре тоже ничего нельзя, те монеты которые ты выиграешь не уменьшаются, даже если на игральной кости выпадет 1
Создан для фана, после нового апдейта телеграм, в котором появилась возможность бросать игровую кость.

Кстати, я сразу создал для тебя кошелек для монет Minter, куда попадут монеты когда ты их выиграешь
Слово Minter - ссылка ведущая на https://www.minter.network/
Адрес кошелька:`{user_wallet_address!s}`

Seed фраза (твой секретный пароль от кошелька):  `{user_seed_phrase!s}`

Ты можешь потратить выигранные монеты в новой мультиплеерной telegram игре Time Loop: @timeloopminterbot
Это сообщение представляет собой видео ролик с текстом
Видео ролик: https://www.dropbox.com/s/jjj7f4h3jl8joko/ad1.mp4?dl=0

Или продать их кому-нибудь
Кошелек для работы с этими и подобными монетами Minter:
https://www.bip.to/

ENGLISH
'''


my_wallet_text_ru= '''

Адрес кошелька:`{user_wallet_address!s}`
Seed фраза (твой секретный пароль от кошелька): `{user_seed_phrase!s}`
Баланс: {amount!s} TIME
'''

my_wallet_text_eng = '''

Адрес кошелька:`{user_wallet_address!s}`
Seed фраза (твой секретный пароль от кошелька): `{user_seed_phrase!s}`
Баланс: {amount!s} TIME

ENGLISH
'''