
choose_language_text = '🌍 Пожалуйста, выберите язык / Choose language'

wallet_text = '''

Текущий баланс : {balance!s} {mnt!s}
Публичный адрес кошелька : {number!s}
Seed-phrase:{seed!s}'

'''

rooles_text = '''

Привет, {user_name}!
Я бот
Правила моей игры очень просты - когда ты пишешь dice time в любом телеграм чате где я добавлен, автоматически бросается игральная кость
Если на ней выпало больше 3, то ты выигрываешь монеты {coin_ticker}
Количество монет зависит от того какое число тебе выпало и насколько большой чат в котором произошел бросок кубика
Ты не можешь выиграть дважды в одном и том же чате в один и тот же день (но не запрещено выигрывать в разных чатах или в разные дни)
Платить ничего не нужно, я полностью бесплатен.
Проиграть в моей игре тоже ничего нельзя, те монеты которые ты выиграешь не уменьшаются, даже если на игральной кости выпадет 1
Создан для фана, после нового апдейта телеграм, в котором появилась возможность бросать игровую кость.

'''

hello_text = '''
Ты можешь потратить выигранные монеты в новой мультиплеерной telegram игре Time Loop: @timeloopminterbot
Это сообщение представляет собой видео ролик с текстом
Видео ролик: https://www.dropbox.com/s/jjj7f4h3jl8joko/ad1.mp4?dl=0
'''
